{"title": "How do we submit this to editor for release.\n\n\n\nNORTH CAROLINA GENERAL ASSEMBLY\n\nRaleigh, North Carolina 27601\n\ncc\n\nDecember 20, 2011\n\nMEMORANDUM\n\nTO:\n\nRep. Jonathan Jordan, co-chair\n\nRep. Carolyn Justice, co-chair\n\nRep. Justin Burr\n\nRep. Kelly Hastings\n\nRep. Julia Howard\n\nRep. Darrell McCormick\n\nRep. Rodney Moore\n\nRep. Tim Spear\n\nRep. Jennifer Weiss\n\nRep. Winkie Wilkins\n\nFROM:\n\nEd Stiles, Committee Assistant\n\nHouse Select Committee on Homeowners Associations\n\nSUBJECT:\n\nMeeting Notice/Notice of Public Hearing PLEASE NOTE DATE CHANGE\n\nDAY\n\nDATE\n\nTIME\n\nROOM\n\nMonday January 23, 2012\n\n1:00 p.m.\n\nLegislative Auditorium (3rd Floor in the Legislative Building)\n\nThe House Select Committee on Homeowners Associations will hold a meeting on Monday, January 23, 2012 at 1:00 p.m. in the Legislative Auditorium, 3rd Floor of the Legislative Building in Raleigh. The meeting agenda will include opportunity for public comment on issues related to homeowners associations. All persons who wish to be heard must reserve a place on the agenda by contacting Committee Assistant, Ed Stiles, at 919-733-5956 or McGradyla@ncleg.net by 5:00 p.m. on Wednesday, January 18, 2012. You can also sign up online by going to the Committee Website and click Public Hearing.\n\nWritten comments are encouraged, but not required. However, in order that their statement may be made a part of the record, speakers are encouraged to provide the Committee Assistant with a copy of their prepared remarks in advance of the meeting via email or at the time of the hearing.\n\nOral presentations will take place in an order determined by the Co-Chairs of the Committee. Oral presentations will be strictly limited to a maximum of three (3) minutes. Persons who wish to present additional information to the Committee, and any person who cannot be scheduled or heard in the time provided, may submit a copy of their statement to the Committee Assistant prior to 5:00 p.m. Wednesday, January 18, 2012. for inclusion in the record.\n\nNote: As many persons as possible will be scheduled and heard within the time reserved. Because of time limitations, it may not be possible to schedule all who request to speak. Should the hearing run ahead of schedule, additional persons will be heard as time permits. Speakers will not be permitted to exchange scheduled times or to transfer their time to another speaker.\n\nAny person who desires additional information about this hearing should contact the Committee Assistant as indicated above.\n\nParking for non-legislative members of the committee/commission is available in the visitor parking deck #75 located on Salisbury Street across from the Legislative Office Building. Parking is also available in the parking lot across Jones Street from the State Library/Archives. You can view a map of downtown by visiting http://www.ncleg.net/graphics/downtownmap.pdf.\n\nIf you have any questions concerning this meeting, please contact Ed Stiles at 919-733-5956.\n\ncc: Committee Record _X_\n\nInterested Parties _X_", "text": " Here's a link to the answer to your question. http://www.starnewsonline.com/section/letters "}