{"title": "Dear Sirs:\n\n   I am seeking your help with a matter that is driving our entire neighborhood insane. We live in the Hoods Creek subdivision off Mt. Misery road (Black Chestnut Dr.), and the division consists of approxamitly fifty houses on public roads. The problem is(and has been going on for over a year now)young teenagers with dirt bikes racing up and down the main roads at speeds up to 50 mph from 10AM to 9PM every weekend(also every day when they get home from school).\n\n   There are plenty of trails in the vicinity for them to play on,yet they insist on using the public roads here. the authorities have been contacted numerous times and yet nothing has changed(in fact theyare roaring past as I write). Not only is this activity illegal on public roads, the children don\\'t even wear helmets, exceed the speed limits(35mph),and exceed noise codes.\n\n   It makes one wonder what type of parent would actively engage in letting  their children endanger not only their own lives, but everyone elses who dare drive on our roads.We used to have young families walking with their strollers, now they are afraid to use the very streets they pay taxes for!\n\n   Every time the police are called, and dispatched the bikes dissapper into a fenced back yard within 5 minutes then reappear as soon as their gone. Makes one wonder if someone has a police scanner. People are afraid to confront these parents because every time someone has they find broken car and home windows. In short the people of this small community are prisoners to a bunch of bullies who are getting away with whatever they want. I honestly believe the only time Brunswick County will do anything about this will be when one of these 12 year olds runs into a vehicle at 50mph and a life is needlessly lost.\n\n  We are all asking for any help you can give us so we may regain our community and our peace of mind.\n\n                       Sincerely,\n\n                         All the residents of Hoods Creek Community     ", "text": " Here's a link to the answer to your question. http://www.myreporter.com/?p=13108  "}