{"title": "How much money have the homeless meters collected since they were installed?", "text": "  \n\n\n\nThe answer is: Organizers donÍt know yet.\n\nThe yellow meters have only been in place a few weeks, and the two\nstaffers with the 10 Year Plan to End Chronic Homelessness and Reduce\nHomelessness in the Cape Fear Region have not emptied them yet.\n\nThe black-and-yellow meters, actually repainted parking meters, are\nbeing installed to reduce panhandling.\n\nThe first Make a Change meter was installed July 22 in front of the\nU.S. Post Office on North Front Street.\n\nAs of Oct. 6, said Dan Ferrell, project manager for the local 10-Year\nPlan, five meters were installed: at the post office, in front of the\nmain branch of the New Hanover County Public Library, in front of the\nNew Hanover County Courthouse, by City Hall/Thalian Hall and near\nFront StreetÍs Bailey Theater Park.\n\nWithin a month or so, another five or six will go up at various\nlocations downtown identified as hot spots for pandhandling, which is\nillegal in the downtown area.\n\nOfficials with the 10 Year Plan encourage people to put quarters in\nthe meters when they are approached by people asking for ñspare\nchange.î\n\nHomeless advocates recommend against giving money to panhandlers.\nSuch donations do little to stop homelessness and the behavior can\nincrease the stigma against homelessness.\n\nñNot all panhandlers are homeless and not all homeless are\npanhandlers,î Ferrell said.\n\nHe and part-time employee Brandi Tanger work out of offices at United\nWay of the Cape Fear Area. The 10-Year Plan effort is funded by the\ncity of Wilmington, New Hanover County and the local United Way.\n\nMoney deposited in the meters will help agencies that assist the\nhomeless, Ferrell said.\n\nHe said a collection will be made sometime in coming weeks and weÍll\nupdate this question when a figure is available.\n\nBut Ferrell warns not to expect too much.\n\nñWe donÍt expect those to be big money-makers,î he said. ñWe do want\nthem to be a deterrent to panhandling.î"}