{"title": "      First Time Homebuyers Credit is a complete scam. Hardworking Americans lead to believe if they put everything they have into buying a home, that the government will help them. This is what happened to my husband and I. We were renters for many years, knew that eventually we wanted to buy a home just not sure when. With the economy going up and down all the time it had never been the right time. Finally we see the First Time Homebuyers credit! We decided this is it, the perfect time to buy and get something back to help with repairs and other cost that come with being a homeowner. I also found out I was pregnant with our second child, and knew that the money would come in handy for his birth. \n\n\n\n     We closed in September and not long after had our accountant file the amended return for 2008. We had our accountant do it to make sure all papers and forms were filed correctly. Then the waiting began. In November we received a letter stating that more forms were needed to complete our return. Those forms were done and mailed (certified to be sure) by the next day. Back to waiting again. I called the IRS in December to make sure that the forms we had mailed back were received and this is when I was assured everything was on track. I should have my money by the end of January. \n\n\n\n    January arrives I call the IRS back to check the status and again Iäó»m assured that it will be here no later then February 11th. So now the dates have changed once again. Today I decided to call once again just to see if things were still on for February 11th. This time after being on hold for nearly an hour, and being transferred a few times Iäó»m informed they canäó»t verify that I purchased my home? Itäó»s going to take another 180 days to contact my mortgage company to get a copy of the title. \n\n\n\n     I explain that I can give them anything they need to prove I bought this house, but Iäó»m informed thereäó»s nothing I can do to speed the process along. So 180 days is how long it will take to verify this? Why was I not notified before now that something else was needed to get my money? Why did it take 4 Months to figure out this information? Then to top it off I ask that Iäó»ve heard you get interest towards your money after the 16 weeks is up. I guess we donäó»t qualify since we filed an amended return?\n\n\n\n     To top the day off I finally see the commercial on TV where this program has been extended. If thereäó»s no money to give back why is the government putting themselves further in debt by promising more people something that will most likely remain a dream for us? Iäó»m a hardworking American citizen, Iäó»ve always paid my taxes on time, and I feel that I deserve whatäó»s been promised to me without having to jump thru hoops! Iäó»ve come to the conclusion that I will not be receiving the money by the birth of my child in April (thatäó»s a big let down). Iäó»m wondering after this 180 days is up what will they find next to drag this out even longer ?\n\n\n\n", "text": "  \n\nWe can't offer you legal or financial advice on the details of your\nsituation. My suggestion would be that you stay in touch with the bank\nand the IRS. If it helps, here is a link to the consumer affairs\ndivision of the N.C. Attorney General's office:\n\n\n\nhttp://www.ncdoj.com/Consumer.aspx\n\n\n\n \n\n\n\n"}