{"title": "How come the Star News does not cover anything that may embarrass the President. No coverage of Acorn or Van Jones or any of the real radical czars, the march on Washington. I could go on and on. This paper is very one sided you had no trouble going after Geo. Bush. This is why I will not be renewing my subscription when it runs out.  ", "text": "  I\nhope I can answer your question.\n\nI'm sorry you're not renewing your subscription to the StarNews but\nhonestly, we're criticized by the left for being too conservative and\ncriticized by the right for being too liberal. There are Republicans\nwho work here; there are Democrats who work here. The truth, whether\nor not you believe it, is we print stories from wire services that\ncover the national news: Our reporters don't cover national stories.\nBut we also don't ignore important stories. We did print stories\nabout the ACORN controversy, but Obama wasn't president then. He's\nonly been president a short time, and has gotten his share of bad\npress: His health-care overhaul problems have been going on all\nsummer. I can't remember our local newspaper 'going after'\nPresident George W. Bush, but if we ran negative type stories, chances\nare he was being criticized and the media was reporting that. News is\nnews, whether it's bad for liberal or bad for conservatives.\nCountless newspapers did not investigate the administration's actions\nafter 9/11, because many feared being described as 'un-American.'\nReporters weren't doing critical stories on the president for years\nafter that horrible event. Many liberals then said we were being too\nnice to the president. So, I guess it depends on your point of view. I\nwould hope that you not turn away from news just because it's not the\nkind of news you want it to be. I would also ask that you come in and\nsee how news stories are selected here at your local newspaper. If you\nthink it's all one-sided I think you'll be surprised at how fair and\nbalanced your local newspaper is. But again, stories aren't picked\nbased on politics. It's based on news. We're not FOX News, but\nwe're also not MSNBC. In truth, we're very much in between. And give\nthe new president some time. I'm sure the negative-type stories are\nbound to come in. Nobody's perfect."}