{"title": "Was there a cemetery that was moved to build New Hanover Regional Medical Center? Where can I find out about family members who were buried there?\n\n\n\nI was visiting my family about 14 years ago and my mother ask me to drive her across the river I think the name was Bellview,but no sure!\n\nMy Mother had always been up since the morning she was in an arearight out side Pottiers Fleid Cematary and watch county and or city workers with truck & other equinment,supposaly take graves up,she had 2 children there,her father that had a very big head stone,as well as my Fathers parents and two sister were buried there in one pliot that my GrandFather Benjamin F.Simmons bought from New Hanover County!\n\nI\\'m trying to find what happen to where they took some of the graves.\n\nI took my Mother there many years ago when I was home and I think the place was called Bellview in Brunwick County on a little road.\n\nThere wasn\\'t even a Sign of a Name of a Cementy must less a sign saying these grave were moved from Pottiers Field in Wilm..\n\nI promised my Mother I would do what I could to find out why the truth was never told and since not just her father bought all the pilots ,they were all together with a small fence around then there were others that bought Family Ploit\\'s,that the county never contacted about they were going to move these graves and never tried to contact the next of kin to buy these pilots,yet they were going to take and move the graves to an unnone place in Brurwick County to make way for the future,and today New Hanover Medical Center is coving what use to be a cematary.\n\nIf anyone can help me find where my Grandparents( Simmons,and Edwards Family Pilot) on both sides were moved and if they have moved them again because I have Friend that live up there that has\\'t been able to find this place in Brunwick County I would sure apperiate it!\n\nThank so much for your help,Kindest Regards,Ellen Edwards,Futrell,Youngest Daugther of Ruth Amanda Simmion Edwards Harker and Henry Warren Edwards ", "text": "  This\nis a link to information about old cemeteries in the Wilmington area.\nWhile it's not quite clear, you may be referring to the entry on the\nold Oak Grove Cemetery that's included here.\nhttp://www.myreporter.com/?p=1354\n\n"}