{"title": "Why does the traffic have to yeild turnning right at the intersection at Paul\\'s Place hot dog resturant in Rocky Point and at the intersection when turnning at the entrance of 408 ramp of I 40 East in Castle Hayne? This is very confusing to driver\\'s that dosen\\'t know to turn left in front of the other traffic turnning right. I was just wandering.", "text": "A representative of N.C. Department of Transportation in Wilmington\nacknowledged the intersections can be confusing, and are being studied\nfor possible changes. \n\nñWe have actually been reviewing that ourselves to see if we can\nchange that traffic pattern,î said Joe Chance, deputy division traffic\nengineer for Division 3, which emcompasses Brunswick, Duplin, New\nHanover, Onslow, Pender and Sampson. \n\nChance said the reason behind it is to allow a safer turn for those\nin the left-turn lane, and to give those vehicles an opportunity to\nturn. ñItÍs ultimately set up for a safer movement and to allow that\nleft-turn traffic to move and not back up.î \n\nIn Pender County at PaulÍs Place, southbound U.S. 117 traffic turning\nright onto N.C. 133 has to yield to the U.S. 117 traffic in the\nnorthbound lane turning left onto N.C. 133. \n\nChance said if there weren't a yield sign at that signalized\nintersection, then the traffic turning left onto N.C. 133 would always\nhave an opposing vehicle in its path. \n\nñThe only solution is to make the left-turn a protected movement,î he\nsaid, by adding a left-turn arrow to the signal. In that scenario,\ndrivers could only turn left with the arrow. The downside would be\nthat changes to the timing at the signal could potentially cause a\nbackup of traffic waiting for the green turn arrow. \n\nChance said Castle Hayne 408 ramp of I-40 east in New Hanover County\nhas a similar traffic pattern, although it doesnÍt have a traffic\nsignal. \n\nHolly Shelter Road traffic heading east in the right-turn lane at the\nramp yields to traffic in the opposite direction turning left onto the\nramp. It needs to be studied first before that yield could be\neliminated though. ñWeÍre looking for a way to change that, and still\ngo by the federal guidelines that we have to follow.î \n\nChance said motorists with questions about the intersections can\ncontact him via email at jchance@ncdot.gov.\n\n\n\n\n\n"}