{"title": "For some time now, Greenlawn Memorial Cemetery has not been flying the American Flag in the Veterans section of the cemetery. There are numerous Veterans buried in this section and throughout the cemetery. I feel this is a disgrace that Greenlawn is not keeping a flag flying. I found this to be especially disturbing on Memorial Day after leaving the Veterans Service at the National Cemetery. These men and women fought and died for OUR freedom, the least Greenlawn could do is show some respect and keep the American flag flying. If you say it\\'s on order then let me remind you that a flag can be purchased locally 7 days a week. You have NO excuse. As the son of a Veteran that is buried in this section and as the President of VFW Post 2573 Men\\'s Auxiliary I find this to be a slap in the face and an insult to every Veteran. So to the management of Greenlawn, get the flag up and keep it up! \n\n\n\nFred Gainey\n\nWilmington\n\nfmgainey@gmail.com\n\n910.620.8823\n\n", "text": "Fred,\n\nWere you intending to post Greenlawn Memorial Cemetery comment as a\nletter to the editor? If so, here's a link to where you can submit\nit: http://www.starnewsonline.com/section/letters.\n\n\n\nHere's your original comment:\n\n\n\nFor some time now, Greenlawn Memorial Cemetery has not been flying\nthe American Flag in the Veterans section of the cemetery. There are\nnumerous Veterans buried in this section and throughout the cemetery.\nI feel this is a disgrace that Greenlawn is not keeping a flag flying.\nI found this to be especially disturbing on Memorial Day after leaving\nthe Veterans Service at the National Cemetery. These men and women\nfought and died for OUR freedom, the least Greenlawn could do is show\nsome respect and keep the American flag flying. If you say it's on\norder then let me remind you that a flag can be purchased locally 7\ndays a week. You have NO excuse. As the son of a Veteran that is\nburied in this section and as the President of VFW Post 2573 Men's\nAuxiliary I find this to be a slap in the face and an insult to every\nVeteran. So to the management of Greenlawn, get the flag up and keep\nit up! \n\n\n\nFred Gainey\n\nWilmington\n\nfmgainey@gmail.com\n\n910.620.8823\n\n\n\n\n\n"}