{"title": "Raising chickens in city of wilmington?", "text": "  \n\n\n\nHere's the city code:\n\n\n\nSec. 6-2. - Domestic fowl.\n\n\n\n(a)\n\n\n\nIt shall be unlawful for the owner or keeper of any chicken or tame\nor domestic fowl of whatever description to permit such an animal to\nbe or run at large within the City.\n\n\n\n(b)\n\n\n\nNo person shall keep or maintain domestic fowl in the City unless the\nfowl will be on a tract of land or maintained as follows:\n\n\n\n(1)\n\n\n\nThe tract shall consist of at least twenty thousand (20,000) square\nfeet under single ownership or control;\n\n\n\n(2)\n\n\n\nSuch fowl must be contained in a secure fenced enclosure at all\ntimes;\n\n\n\n(3)\n\n\n\nThe enclosure shall have a minimum of ten square feet of area for\neach fowl;\n\n\n\n(4)\n\n\n\nNo enclosure shall be erected or maintained within the front or side\nyard (as defined by the zoning ordinance), within twenty-five (25)\nfeet of any property line or within one hundred (100) feet of another\nresidence;\n\n\n\n(5)\n\n\n\nThe enclosure shall be kept clean, sanitary and free from\naccumulations of excrement and objectionable odor; and\n\n\n\n(6)\n\n\n\nNo more than twenty (20) such fowl shall be kept or maintained per\nacre. The number of fowl shall be proportionate to the acreage. There\nwill be no discounting for chicks or other young fowl.\n\n\n\n(c)\n\n\n\nA violation of any provision of this section is hereby declared to be\ndangerous and prejudicial to the public health or safety and to\nconstitute a public nuisance. Such nuisances shall be abated as set\nforth in Article II of Chapter 10 of the Wilmington City Code.\n\n\n\n(Code 1962, Œ_ 5-4; Ord. No. 0-2001-69, Œ_ 1, 10-23-01)\n\n\n\nCharter referenceäóî Authority of city to regulate, restrain and\nprohibit the running at large of animals, Œ_ 1.4(20).\n\n\n\nCounty Code referenceäóî Animal control, Ch.3\n\n\n\nState law referenceäóî Cruelty to animals, G.S. Œ_ 14-360 et seq.;\nprotection of animals, G.S. Ch. 19 A; municipal powers as to animals,\nG.S. Œ_Œ_ 160A-182, 160A-186 et seq.; animal taxes, G.S. Œ_ 160A-212;\nanimal shelters, G.S. Œ_ 160A-493. \n\n\n\n \n\n\n\n"}