{"title": "What is the law concerning tail lights on trailers?", "text": "  \n\n\n\nHere's the law as it is written:\n\nRear Lamps. _ Every motor vehicle, and every trailer or semitrailer\nattached to a motor vehicle and every vehicle which is being drawn at\nthe end of a combination of vehicles, shall have all originally\nequipped rear lamps or the equivalent in good working order, which\nlamps shall exhibit a red light plainly visible under normal\natmospheric conditions from a distance of 500 feet to the rear of such\nvehicle. One rear lamp or a separate lamp shall be so constructed and\nplaced that the number plate carried on the rear of such vehicle shall\nunder like conditions be illuminated by a white light as to be read\nfrom a distance of 50 feet to the rear of such vehicle. Every trailer\nor semitrailer shall carry at the rear, in addition to the originally\nequipped lamps, a red reflector of the type which has been approved by\nthe Commissioner and which is so located as to height and is so\nmaintained as to be visible for at least 500 feet when opposed by a\nmotor vehicle displaying lawful undimmed lights at night on an\nunlighted highway.\n\n\n\nNotwithstanding the provisions of the first paragraph of this\nsubsection, it shall not be necessary for a trailer weighing less than\n4,000 pounds, or a trailer described in G.S. 20&#8209;51(6) weighing\nless than 6,500 pounds, to carry or be equipped with a rear lamp,\nprovided such vehicle is equipped with and carries at the rear two red\nreflectors of a diameter of not less than three inches, such\nreflectors to be approved by the Commissioner, and which are so\ndesigned and located as to height and are maintained so that each\nreflector is visible for at least 500 feet when approached by a motor\nvehicle displaying lawful undimmed headlights at night on an unlighted\nhighway.\n\n\n\nAnd here's a link, if you'd like more information: \n\n\n\nhttp://www.ncga.state.nc.us/EnactedLegislation/Statutes/HTML/ByArticle/Chapter_20/Article_3.html\n\n\n\n \n\n\n\n"}