{"title": "My license are suspended for DWI. Providing I have completed my assessment as well as all required classes, I am eligible to have my license restored 5/25/11.  While my license has been suspended I have been driving a less than 50 cc moped.  I had an accident while on the moped.  It was my fault and I was charged with either unsafe movement or reckless driving.  I went to court, pled guilty, paid my court costs and fines and that was the end of that.................or so I thought.\n\nI now get a letter from the DMV in raleigh that that was my first moving offense while licence are suppended and now they want to suspend my drivers license for a whole more year to 2012.  If the officer can give me a ticket for wreckless driving, then why didn\\'t he not arrest me for DWLR?  I wasn\\'t charged with DWLR at all.  I called my dmv here locally and they informed me that obviously dmv did not realize I was driving a moped, not a vehicle! and that this citation would not have any bearing on when my license can be restored.  I called the police dept here and was told the exact same thing.  DMV in raleigh won\\'t even allow me to have a hearing about this until the assessment is done. I haven\\'t done that because I don\\'t have the $ 100.00 right now and my moped is inoperable too.  I am getting copies of the police report and the judgement the judge handed down.  If it does not specify whether it was a moped or a vehicle..............what can I do?  My orignial pink citation the office gave me, just describes the scene, he does not mention the moped.  I have about 25 people that saw the wreck and I can get the ambulance report too.\n\n\n\nWhat actually is the law in a situation like this?   there was no alcohol or any other substances involved in this wreck and the police stated that in court, that it was clear I had not been drinking.  the convenience store manager that witnessed the wreck agreed and support that fact as well.\n\nthank you\n\ndebra tackett\n\n\n\nI did get injured and taken to the hospital and had surgery on my left thigh.\n\n", "text": "  \n\n\n\nI am sorry to hear about your situation. Unfortunately, these are not\nquestions that can be answered at MyReporter.com. I would suggest you\ncontact a lawyer or Legal Aid.\n\n\n\n \n\n\n\n"}