{"title": "Are there any four star and above restaurants in the Wilmington area?", "text": "  \n\n\n\nRespected restaurant guides such as Zagat and Michelin have yet to\ntackle Wilmington, but the city has numerous fine-dining restaurants\nthat could contend for multiple stars. \n\nSince opening in 2000, Port Land Grille\n(http://www.portlandgrille.com/1908 Eastwood Road, Suite 111, in\nLumina Station) has earned positive reviews. The restaurant also won\nthe 2005 Distinguished Restaurants of North America Award from DiRoNA.\nBased in New York City, DiRoNA was established in 1990 to promote the\nfine-dining industry (http://www.dirona.com/). \n\nMarcÍs on Market (http://www.marcsonmarket.com/ 7213 Market Street)\nconsistently gets high marks from diners. Owner and chef Marc\nCopenhaver won Wilmington magazineÍs first Wilmington Top Chef\ncompetition in 2008.\n\nCatch is another of the cityÍs acclaimed restaurants. Chef/owner\nKeith Rhodes in 2007 won both the fine- and casual-dining categories\nin the N.C. Department of AgricultureÍs Best Dish in North Carolina\ncompetition, which focuses on local ingredients. He was also a\nfinalist in the 2008 Wilmington Top Chef competition. \n\nThe fine-dining award recognized RhodesÍ work at Deluxe\n(http://www.deluxenc.com/), another exceptional Wilmington restaurant,\nespecially known for its extensive wine list, which has won the Wine\nSpectator Award of Excellence each year since 2001. Rhodes served as\nDeluxeÍs executive chef from 2002 to 2009. \n\nThe casual-dining honor recognized RhodesÍ work at Catch.\n\nCaprice Bistro (http://www.capricebistro.com/ 10 Market St.) is\nstar-worthy, too. French chef Thierry Moity has cooked in some of the\nfinest French restaurants in Europe and New York City. While at New\nYorkÍs La Gauloise, Moity won praise from famed New York TimesÍ\nrestaurant reviewers Bryan Miller and Mimi Sheraton. His own former\nCaf_ de Bruxelles in New York City won high marks from Forbes\nmagazine."}